# ============================================================================================
#                                       请求成功判断条件                                        #
#                                    (该部分用于判断请求是否成功)                                 #
# ============================================================================================
"""
这一部分是在请求成功后执行,用于判断响应是否正确
当满足这部分的条件时才会执行后续的解析保存操作
"""


def Request_success_criteria(respones) -> bool:
    if str(respones.status_code)[0] == '2' or str(respones.status_code)[0] == '3':
        return True
    else:
        return False
