# ============================================================================================
#                                           请求参数修改                                       #
#                                  (该部分用于在请求发送前修改参数)                                #
# ============================================================================================
"""
这一部分是在请求发送之前执行,params是请求所需要的所有参数
"""
from Tools.Open_js import open_js

def Request_param_revise(params) -> dict:
    return params
