# ============================================================================================
#                                     请求失败后的参数修改                                       #
#                                (该部分用于在请求失败后修改参数)                                  #
# ============================================================================================
"""
这一部分是在请求失败后执行,params是请求所需要的所有参数
当请求失败后分析原因在下面的方法里修改参数,例如修改代理ip等
"""


def Request_failed_revise(params, respones) -> dict:
    return params
